7CCSMATC.org
#+title: 7CCSMATC: Advanced Topics in Cryptography
#+setupfile: setup.org

** Definitions

We discuss the role of definitions in (modern) cryptography, how definitions can be wrong and how unintuitive definitions might hit the nail on the head.

[[https://malb.github.io/7CCSMATC/lecture-definitions.pdf][slides]]

*Preparatory Reading*

- Phillip Rogaway. /On the Role of Definitions in and beyond Cryptography/. In: Annual Asian Computing Science Conference. Springer. 2004, pp. 13–32

*Dramatis Personae*

- [[https://en.wikipedia.org/wiki/Phillip_Rogaway][Phil Rogaway]]
- [[https://en.wikipedia.org/wiki/Shafi_Goldwasser][Shafi Goldwasser]]
- [[https://en.wikipedia.org/wiki/Silvio_Micali][Silvio Micali]]

** Game Playing

Following Mike's rather excellent book /The Joy of Cryptography/, we prove the One-Time-Pad secure to introduce game hopping proofs, a central proof technique in cryptography.

[[https://malb.github.io/7CCSMATC/lecture-game-playing.pdf][slides]]

*Preparatory Reading*

- Mike Rosulek. /The Joy of Cryptography/. https://joyofcryptography.com. self published, 2021, Chapters 1 and 2.

*Dramatis Personae*

- [[https://web.engr.oregonstate.edu/~rosulekm/][Mike Rosulek]]

** Fundamental Lemma of Game Playing

We prove the "Fundamental Lemma of Game Playing" which allows us to diverge in our games once a low-probability event happened. This gives us the "PRP-PRF Switching Lemma" which allows us to "swap" a pseudorandom function (PRF) for a pseudorandom permutation (PRP) without anyone noticing.

[[https://malb.github.io/7CCSMATC/lecture-fundamental-lemma-of-game-playing.pdf][slides]]

*Preparatory Reading*

- Mihir Bellare and Phillip Rogaway. /Code-Based Game-Playing Proofs and the Security of Triple Encryption/. Cryptology ePrint Archive, Report 2004/331. 2004. url: https://eprint.iacr.org/2004/331

*Dramatis Personae*

- [[https://en.wikipedia.org/wiki/Phillip_Rogaway][Phil Rogaway]]
- [[https://en.wikipedia.org/wiki/Mihir_Bellare][Mihir Bellare]]
  
** Indistinguishability

We introduce the /assumption/ that AES-128 is a pseudorandom permutation. This finishes our proof that AES-128 in CTR mode is secure if AES-128 is a PRP.

[[https://malb.github.io/7CCSMATC/lecture-indistinguishability.pdf][slides]]

*Dramatis Personae*

- [[https://dblp.org/pid/b/AndreyBogdanov.html][Andrey Bogdanov]]
- [[https://en.wikipedia.org/wiki/Dmitry_Khovratovich][Dmitry Khovratovich]]
- [[https://www.iaik.tugraz.at/person/christian-rechberger/][Christian Rechberger]]

** Assumptions and Minicrypt v Cryptomania

We go all-in on cryptographic assumptions which underpin most cryptographic guarantees. These give rise to two plausible "worlds" of cryptography: one, called "Minicrypt", where only one-way functions (OWFs) exist and one where public-key cryptography exists, called "Cryptomania". Then, in 1994 Peter Shor snapped his fingers and wiped out all widely used public-key encryption schemes. The catch: you would need a quantum computer to run his algorithm. This provoked the creation of “post-quantum cryptography” lest we want to live in Minicrypt.

[[https://malb.github.io/7CCSMATC/lecture-assumptions.pdf][slides]]

*Preparatory Reading*

- Boaz Barak. /The Complexity of Public-Key Cryptography./ Cryptology ePrint Archive, Report 2017/365. 2017. url: https://eprint.iacr.org/2017/365

*Dramatis Personae*

- [[https://en.wikipedia.org/wiki/Silvio_Micali][Silvio Micali]]
- [[https://en.wikipedia.org/wiki/Ralph_Merkle][Ralph Merkle]]
- [[https://en.wikipedia.org/wiki/Russell_Impagliazzo][Russell Impagliazzo]]
- [[https://www.boazbarak.org/][Boaz Barak]]
- [[https://en.wikipedia.org/wiki/Orr_Dunkelman][Orr Dunkelman]]
- [[https://en.wikipedia.org/wiki/Ron_Rivest][Ron Rivest]]
- [[https://en.wikipedia.org/wiki/Adi_Shamir][Adi Shamir]]
- [[https://en.wikipedia.org/wiki/Leonard_Adleman][Leonard Adleman]]          
- [[https://en.wikipedia.org/wiki/Whitfield_Diffie][Whit Diffie]]
- [[https://en.wikipedia.org/wiki/Martin_Hellman][Martin Hellman]]
- [[https://en.wikipedia.org/wiki/Peter_Shor][Peter Shor]]
- [[https://homes.esat.kuleuven.be/~wcastryc/][Wouter Castryck]]
- [[https://www.esat.kuleuven.be/cosic/people/thomas-decru/][Thomas Decru]]
- [[https://iacr.org/cryptodb/data/author.php?authorkey=10892][Ward Beullens]]
  
** Quantum Computing

We discuss hopefully just enough quantum computing to convince you that quantum computers are not faster, they are weirder. The first half of the lecture introduces quantum mechanics, the second half discusses that what we mean by "secure" may need to change when faced with a quantum adversary.

[[https://malb.github.io/7CCSMATC/lecture-quantum.pdf][slides]]

*Preparatory Reading*

- Noson S Yanofsky and Mirco A Mannucci. /Quantum Computing for Computer Scientists./ Cambridge University Press, 2008, esp. Chapters 1, 2 and 3.

*Dramatis Personae*

- [[http://tdalazard.io/][Thomas Debris-Alazard]]
- [[http://www.sci.brooklyn.cuny.edu/~noson/][Noson S Yanofsky]]
- [[https://cs.gmu.edu/~mmannucc/][Mirco A Mannucci]]
- [[https://en.wikipedia.org/wiki/William_A._Stein][William Stein]]
- [[https://en.wikipedia.org/wiki/Peter_Shor][Peter Shor]]
- [[https://en.wikipedia.org/wiki/Andris_Ambainis][Andris Ambainis]]
- [[http://rosmanis.com/research/index.html][Ansis Rosmanis]]
- [[https://kodu.ut.ee/~unruh/][Dominique Unruh]]
- [[https://fermima.com/][Fermi Ma]]

