7CCSMATC.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-27 Tue 15:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>7CCSMATC: Advanced Topics in Cryptography</title>
<meta name="author" content="Martin R. Albrecht" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="css/worg.css" type="text/css" media="screen" />
<link rel="stylesheet" type="text/css" href="css/bundle.css"/>
<link rel="stylesheet" type="text/css" href="css/custom.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">7CCSMATC: Advanced Topics in Cryptography</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgebf35ba">Definitions</a></li>
<li><a href="#orgbb8f45d">Game Playing</a></li>
<li><a href="#orgae69d11">Fundamental Lemma of Game Playing</a></li>
<li><a href="#org7722856">Indistinguishability</a></li>
<li><a href="#orge3a32f6">Assumptions and Minicrypt v Cryptomania</a></li>
<li><a href="#orgca4ef0a">Quantum Computing</a></li>
<li><a href="#org98509d4">Learning with Errors</a></li>
<li><a href="#org45ce374">Minicrypt with Algebraic Structure</a></li>
<li><a href="#org11e4b51">The Random Oracle Model</a></li>
<li><a href="#org273817f">The Fujisaki-Okamoto Transform</a></li>
<li><a href="#org4b5b6e6">Hash-and-Sign Signatures</a></li>
<li><a href="#org5d5dd70">Rewinding</a></li>
<li><a href="#org31d5f90">Limits of Proofs (SSH Attack)</a></li>
<li><a href="#org811cba1">Limits of Proofs (Heartbleed)</a></li>
<li><a href="#org0f16859">Limits of Proofs (S2N)</a></li>
<li><a href="#org7a57c24">Limits of Proofs (Societal Foundations)</a></li>
<li><a href="#org3109886">Limits of Proofs (Social Foundations)</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgebf35ba" class="outline-2">
<h2 id="orgebf35ba">Definitions</h2>
<div class="outline-text-2" id="text-orgebf35ba">
<p>
We discuss the role of definitions in (modern) cryptography, how definitions can be wrong and how unintuitive definitions might hit the nail on the head.
</p>

<p>
<a href="./7CCSMATC/lecture-definitions.pdf">slides</a>
</p>

<p>
<b>Preparatory Reading</b>
</p>

<ul class="org-ul">
<li>Phillip Rogaway. <i>On the Role of Definitions in and beyond Cryptography</i>. In: Annual Asian Computing Science Conference. Springer. 2004, pp. 13–32</li>
</ul>

<p>
<b>Dramatis Personae</b>
</p>

<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/Phillip_Rogaway">Phil Rogaway</a></li>
<li><a href="https://en.wikipedia.org/wiki/Shafi_Goldwasser">Shafi Goldwasser</a></li>
<li><a href="https://en.wikipedia.org/wiki/Silvio_Micali">Silvio Micali</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgbb8f45d" class="outline-2">
<h2 id="orgbb8f45d">Game Playing</h2>
<div class="outline-text-2" id="text-orgbb8f45d">
<p>
Following Mike's rather excellent book <i>The Joy of Cryptography</i>, we prove the One-Time-Pad secure to introduce game hopping proofs, a central proof technique in cryptography.
</p>

<p>
<a href="./7CCSMATC/lecture-game-playing.pdf">slides</a>
</p>

<p>
<b>Preparatory Reading</b>
</p>

<ul class="org-ul">
<li>Mike Rosulek. <i>The Joy of Cryptography</i>. <a href="https://joyofcryptography.com">https://joyofcryptography.com</a>. self published, 2021, Chapters 1 and 2.</li>
</ul>

<p>
<b>Dramatis Personae</b>
</p>

<ul class="org-ul">
<li><a href="https://web.engr.oregonstate.edu/~rosulekm/">Mike Rosulek</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgae69d11" class="outline-2">
<h2 id="orgae69d11">Fundamental Lemma of Game Playing</h2>
<div class="outline-text-2" id="text-orgae69d11">
<p>
We prove the "Fundamental Lemma of Game Playing" which allows us to diverge in our games once a low-probability event happened. This gives us the "PRP-PRF Switching Lemma" which allows us to "swap" a pseudorandom function (PRF) for a pseudorandom permutation (PRP) without anyone noticing.
</p>

<p>
<a href="./7CCSMATC/lecture-fundamental-lemma-of-game-playing.pdf">slides</a>
</p>

<p>
<b>Preparatory Reading</b>
</p>

<ul class="org-ul">
<li>Mihir Bellare and Phillip Rogaway. <i>Code-Based Game-Playing Proofs and the Security of Triple Encryption</i>. Cryptology ePrint Archive, Report 2004/331. 2004. url: <a href="https://eprint.iacr.org/2004/331">https://eprint.iacr.org/2004/331</a></li>
</ul>

<p>
<b>Dramatis Personae</b>
</p>

<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/Phillip_Rogaway">Phil Rogaway</a></li>
<li><a href="https://en.wikipedia.org/wiki/Mihir_Bellare">Mihir Bellare</a></li>
</ul>
</div>
</div>

<div id="outline-container-org7722856" class="outline-2">
<h2 id="org7722856">Indistinguishability</h2>
<div class="outline-text-2" id="text-org7722856">
<p>
We introduce the <i>assumption</i> that AES-128 is a pseudorandom permutation. This finishes our proof that AES-128 in CTR mode is secure if AES-128 is a PRP.
</p>

<p>
<a href="./7CCSMATC/lecture-indistinguishability.pdf">slides</a>
</p>

<p>
<b>Dramatis Personae</b>
</p>

<ul class="org-ul">
<li><a href="https://dblp.org/pid/b/AndreyBogdanov.html">Andrey Bogdanov</a></li>
<li><a href="https://en.wikipedia.org/wiki/Dmitry_Khovratovich">Dmitry Khovratovich</a></li>
<li><a href="https://www.iaik.tugraz.at/person/christian-rechberger/">Christian Rechberger</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge3a32f6" class="outline-2">
<h2 id="orge3a32f6">Assumptions and Minicrypt v Cryptomania</h2>
<div class="outline-text-2" id="text-orge3a32f6">
<p>
We go all-in on cryptographic assumptions which underpin most cryptographic guarantees. These give rise to two plausible "worlds" of cryptography: one, called "Minicrypt", where only one-way functions (OWFs) exist and one where public-key cryptography exists, called "Cryptomania". Then, in 1994 Peter Shor snapped his fingers and wiped out all widely used public-key encryption schemes. The catch: you would need a quantum computer to run his algorithm. This provoked the creation of “post-quantum cryptography” lest we want to live in Minicrypt.
</p>

<p>
<a href="./7CCSMATC/lecture-assumptions.pdf">slides</a>
</p>

<p>
<b>Dramatis Personae</b>
</p>

<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/Silvio_Micali">Silvio Micali</a></li>
<li><a href="https://en.wikipedia.org/wiki/Ralph_Merkle">Ralph Merkle</a></li>
<li><a href="https://en.wikipedia.org/wiki/Russell_Impagliazzo">Russell Impagliazzo</a></li>
<li><a href="https://www.boazbarak.org/">Boaz Barak</a></li>
<li><a href="https://en.wikipedia.org/wiki/Orr_Dunkelman">Orr Dunkelman</a></li>
<li><a href="https://en.wikipedia.org/wiki/Ron_Rivest">Ron Rivest</a></li>
<li><a href="https://en.wikipedia.org/wiki/Adi_Shamir">Adi Shamir</a></li>
<li><a href="https://en.wikipedia.org/wiki/Leonard_Adleman">Leonard Adleman</a></li>
<li><a href="https://en.wikipedia.org/wiki/Whitfield_Diffie">Whit Diffie</a></li>
<li><a href="https://en.wikipedia.org/wiki/Martin_Hellman">Martin Hellman</a></li>
<li><a href="https://en.wikipedia.org/wiki/Peter_Shor">Peter Shor</a></li>
<li><a href="https://homes.esat.kuleuven.be/~wcastryc/">Wouter Castryck</a></li>
<li><a href="https://www.esat.kuleuven.be/cosic/people/thomas-decru/">Thomas Decru</a></li>
<li><a href="https://iacr.org/cryptodb/data/author.php?authorkey=10892">Ward Beullens</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgca4ef0a" class="outline-2">
<h2 id="orgca4ef0a">Quantum Computing</h2>
<div class="outline-text-2" id="text-orgca4ef0a">
<p>
We discuss hopefully just enough quantum computing to convince you that quantum computers are not faster, they are weirder. The first half of the lecture introduces quantum mechanics, the second half discusses that what we mean by "secure" may need to change when faced with a quantum adversary.
</p>

<p>
<a href="./7CCSMATC/lecture-fundamental-quantum-computing.pdf">slides</a>
</p>

<p>
<b>Preparatory Reading</b>
</p>

<ul class="org-ul">
<li>Noson S Yanofsky and Mirco A Mannucci. <i>Quantum Computing for Computer Scientists.</i> Cambridge University Press, 2008, esp. Chapters 1, 2 and 3.</li>
</ul>

<p>
<b>Dramatis Personae</b>
</p>

<ul class="org-ul">
<li><a href="http://tdalazard.io/">Thomas Debris-Alazard</a></li>
<li><a href="http://www.sci.brooklyn.cuny.edu/~noson/">Noson S Yanofsky</a></li>
<li><a href="https://cs.gmu.edu/~mmannucc/">Mirco A Mannucci</a></li>
<li><a href="https://en.wikipedia.org/wiki/William_A._Stein">William Stein</a></li>
<li><a href="https://en.wikipedia.org/wiki/Peter_Shor">Peter Shor</a></li>
<li><a href="https://en.wikipedia.org/wiki/Andris_Ambainis">Andris Ambainis</a></li>
<li><a href="http://rosmanis.com/research/index.html">Ansis Rosmanis</a></li>
<li><a href="https://kodu.ut.ee/~unruh/">Dominique Unruh</a></li>
<li><a href="https://fermima.com/">Fermi Ma</a></li>
</ul>
</div>
</div>
