7CCSMATC.org
** Learning with Errors

We discuss the Learning with Errors (LWE) problem which needs to be hard for our post-quantum standards to be secure. It asserts that adding a small bit of "noise" or "error" to a linear system of equations makes it hard to solve, even on a quantum computer.

[[https://malb.github.io/7CCSMATC/lecture-lwe.pdf][slides]]

*Preparatory Reading*

- Chris Peikert, /A decade of lattice cryptography./ Cryptology ePrint Archive, Report 2015/939. https://eprint.iacr.org/2015/939

*Dramatis Personae*

- [[https://en.wikipedia.org/wiki/Oded_Regev_(computer_scientist)][Oded Regev]]
- [[https://web.eecs.umich.edu/~cpeikert/][Chris Peikert]]  
  
** Minicrypt with Algebraic Structure

Minicrypt is a "world" built from one-way functions (OWFs), can we find similar constitutive primitives for the "world" of public-key cryptography? What algebraic structure can we add to e.g. OWFs to arrive at public-key encryption?

[[https://malb.github.io/7CCSMATC/lecture-minicrypt-with-algebraic-structure.pdf][slides]]

*Preparatory Reading*

- Navid Alamati, Hart Montgomery, Sikhar Patranabis, and Arnab Roy. /Minicrypt Primitives with Algebraic Structure and Applications/. In: Journal of Cryptology 36.1 (Jan. 2023), p. 2. doi: 10.1007/s00145-022-09442-2

*Dramatis Personae*

- [[https://usa.visa.com/about-visa/visa-research/navid-alamati.html][Navid Alamati]]
- [[https://iacr.org/cryptodb/data/author.php?authorkey=7454][Hart Montgomery]]
- [[https://sites.google.com/site/sikharpatranabis/home][Sikhar Patranabis]]
- [[https://iacr.org/cryptodb/data/author.php?authorkey=3773][Arnab Roy]]

** The Random Oracle Model

The Random Oracle Model (ROM) /pretends/ that hash functions like SHA-3 are random functions. The reason why your favourite cryptographic construction has a hash function call is probably not the reason you think it is. We know that the ROM is not true and we will discuss schemes that are secure under this pretence but insecure when built with /any/ real hash function. Yet, the Internet runs on schemes proven secure only in the ROM.

[[https://malb.github.io/7CCSMATC/lecture-rom.pdf][slides]]

*Preparatory Reading*

- Arno Mittelbach and Marc Fischlin. /Chapter 9: The Full Power of Random Oracles./ In: The Theory of Hash Functions and Random Oracles - An Approach to Modern Cryptography. Information Security and Cryptography. Springer, 2021. isbn: 978-3-030-63286-1. doi: 10.1007/978-3-030-63287-8. url: https://doi.org/10.1007/978-3-030-63287-8
- Oded Goldreich. /On Post-Modern Cryptography./ Cryptology ePrint Archive, Report 2006/461. 2006. url: https://eprint.iacr.org/2006/461
- Phillip Rogaway. /Practice-Oriented Provable Security and the Social Construction of Cryptography./ In: IEEE Secur. Priv. 14.6 (2016), pp. 10–17. doi: 10.1109/MSP.2016.122. url: https://doi.org/10.1109/MSP.2016.122
  
*Dramatis Personae*

- [[https://en.wikipedia.org/wiki/Phillip_Rogaway][Phil Rogaway]]
- [[https://en.wikipedia.org/wiki/Mihir_Bellare][Mihir Bellare]]
- [[http://www.arno-mittelbach.de/][Arno Mittelbach]]
- [[https://www.cryptoplexity.informatik.tu-darmstadt.de/cryptoplexity/team_cryptoplexity/marc_fischlin_cryptoplexity/index.en.jsp][Marc Fischlin]]
- [[https://en.wikipedia.org/wiki/Oded_Goldreich][Oded Goldreich]]

** The Fujisaki-Okamoto Transform

We will discuss the Fujisaki-Okamoto (FO) Transform for converting CPA secure schemes into CCA secure schemes in the random oracle model … using one weird trick, adversaries hate it.

[[https://malb.github.io/7CCSMATC/lecture-fo.pdf][slides]]

*Preparatory Reading*

- Alexander W. Dent. /A Designer’s Guide to KEMs./ In: 9th IMA International Conference on Cryptography and Coding. Ed. by Kenneth G. Paterson. Vol. 2898. LNCS. Springer, Berlin, Heidelberg, Dec. 2003, pp. 133–151. doi: 10.1007/978-3-540-40974-8_12

*Dramatis Personae*

- [[https://www.jaist.ac.jp/~fujisaki/index-e.html][Eiichiro Fujisaki]]
- [[https://www.rd.ntt/e/organization/researcher/fellow/f_001.html][Tatsuaki Okamoto]]
- [[http://cogentcryptography.com/][Alexander W. Dent]]  

** Hash-and-Sign Signatures

We discuss the hash-and-sign signature paradigm, proven secure in the random oracle model. We also discuss the GPV signature scheme paradigm, of which Falcon (soon to be a NIST standard for post-quantum signatures) is an example.

[[https://malb.github.io/7CCSMATC/lecture-gpv.pdf][slides]]

*Preparatory Reading*

- Craig Gentry, Chris Peikert, and Vinod Vaikuntanathan. /Trapdoors for hard lattices and new cryptographic constructions/. In: 40th ACM STOC. ed. by Richard E. Ladner and Cynthia Dwork. ACM Press, May 2008, pp.197–206. doi: 10.1145/1374376.1374407

*Dramatis Personae*

- [[https://homepages.cwi.nl/~ducas/][Léo Ducas]]
- [[https://en.wikipedia.org/wiki/Craig_Gentry][Craig Gentry]]
- [[https://web.eecs.umich.edu/~cpeikert/][Chris Peikert]]
- [[https://en.wikipedia.org/wiki/Vinod_Vaikuntanathan][Vinod Vaikuntanathan]]

** Rewinding

We discuss "rewinding" as a cryptographic proof technique, typically in the random oracle model (ROM). We can make an adversary reveal its secrets by making it solving a task more than once.

[[https://malb.github.io/7CCSMATC/lecture-rewinding.pdf][slides]]

*Preparatory Reading*

- Arno Mittelbach and Marc Fischlin. Chapter 10: Random Oracle Schemes in Practice. In: The Theory of Hash Functions and Random Oracles - An Approach to Modern Cryptography. Information Security and Cryptography. Springer, 2021. isbn: 978-3-030-63286-1. doi: 10.1007/978-3-030-63287-8. url: https://doi.org/10.1007/978-3-030-63287-8 
- Ivan Damgård. /On Σ-protocols/. In: Lecture Notes, University of Aarhus, Department for Computer Science 84 (2002). https://www.cs.au.dk/~ivan/Sigma.pdf
  
*Dramatis Personae*

- [[http://www.arno-mittelbach.de/][Arno Mittelbach]]
- [[https://www.cryptoplexity.informatik.tu-darmstadt.de/cryptoplexity/team_cryptoplexity/marc_fischlin_cryptoplexity/index.en.jsp][Marc Fischlin]]
- [[https://en.wikipedia.org/wiki/Claus_P._Schnorr][Claus-Peter Schnorr]]
- [[https://en.wikipedia.org/wiki/Ivan_Damg%C3%A5rd][Ivan Damgård]]
- [[https://en.wikipedia.org/wiki/Amos_Fiat][Amos Fiat]]
- [[https://en.wikipedia.org/wiki/Adi_Shamir][Adi Shamir]]
- [[https://crypto.stanford.edu/~eujin/][Eu-Jin Goh]]
- [[https://ics.uci.edu/people/stanislaw-jarecki/][Stanislaw Jarecki]]
- [[https://en.wikipedia.org/wiki/Jonathan_Katz][Jonathan Katz]]
- [[https://dblp.uni-trier.de/pid/w/NanWang.html][Nan Wang]]
  
