7CCSMATC.html

<div id="outline-container-org98509d4" class="outline-2">
<h2 id="org98509d4">Learning with Errors</h2>
<div class="outline-text-2" id="text-org98509d4">
<p>
We discuss the Learning with Errors (LWE) problem which needs to be hard for our post-quantum standards to be secure. It asserts that adding a small bit of "noise" or "error" to a linear system of equations makes it hard to solve, even on a quantum computer.
</p>

<p>
<a href="./7CCSMATC/lecture-fundamental-lwe.pdf">slides</a>
</p>

<p>
<b>Preparatory Reading</b>
</p>

<ul class="org-ul">
<li>Chris Peikert, <i>A decade of lattice cryptography.</i> Cryptology ePrint Archive, Report 2015/939. <a href="https://eprint.iacr.org/2015/939">https://eprint.iacr.org/2015/939</a></li>
</ul>

<p>
<b>Dramatis Personae</b>
</p>

<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/Oded_Regev_(computer_scientist)">Oded Regev</a></li>
<li><a href="https://web.eecs.umich.edu/~cpeikert/">Chris Peikert</a></li>
</ul>
</div>
</div>

<div id="outline-container-org45ce374" class="outline-2">
<h2 id="org45ce374">Minicrypt with Algebraic Structure</h2>
<div class="outline-text-2" id="text-org45ce374">
<p>
Minicrypt is a "world" built from one-way functions (OWFs), can we find similar constitutive primitives for the "world" of public-key cryptography? What algebraic structure can we add to e.g. OWFs to arrive at public-key encryption?
</p>

<p>
<a href="./7CCSMATC/lecture-minicrypt-with-algebraic-structure.pdf">slides</a>
</p>

<p>
<b>Preparatory Reading</b>
</p>

<ul class="org-ul">
<li>Navid Alamati, Hart Montgomery, Sikhar Patranabis, and Arnab Roy. <i>Minicrypt Primitives with Algebraic Structure and Applications</i>. In: Journal of Cryptology 36.1 (Jan. 2023), p. 2. doi: 10.1007/s00145-022-09442-2</li>
</ul>

<p>
<b>Dramatis Personae</b>
</p>

<ul class="org-ul">
<li><a href="https://usa.visa.com/about-visa/visa-research/navid-alamati.html">Navid Alamati</a></li>
<li><a href="https://iacr.org/cryptodb/data/author.php?authorkey=7454">Hart Montgomery</a></li>
<li><a href="https://sites.google.com/site/sikharpatranabis/home">Sikhar Patranabis</a></li>
<li><a href="https://iacr.org/cryptodb/data/author.php?authorkey=3773">Arnab Roy</a></li>
</ul>
</div>
</div>

<div id="outline-container-org11e4b51" class="outline-2">
<h2 id="org11e4b51">The Random Oracle Model</h2>
<div class="outline-text-2" id="text-org11e4b51">
<p>
The Random Oracle Model (ROM) <i>pretends</i> that hash functions like SHA-3 are random functions. The reason why your favourite cryptographic construction has a hash function call is probably not the reason you think it is. We know that the ROM is not true and we will discuss schemes that are secure under this pretence but insecure when built with <i>any</i> real hash function. Yet, the Internet runs on schemes proven secure only in the ROM.
</p>

<p>
<a href="./7CCSMATC/lecture-rom.pdf">slides</a>
</p>

<p>
<b>Preparatory Reading</b>
</p>

<ul class="org-ul">
<li>Arno Mittelbach and Marc Fischlin. <i>Chapter 9: The Full Power of Random Oracles.</i> In: The Theory of Hash Functions and Random Oracles - An Approach to Modern Cryptography. Information Security and Cryptography. Springer, 2021. isbn: 978-3-030-63286-1. doi: 10.1007/978-3-030-63287-8. url: <a href="https://doi.org/10.1007/978-3-030-63287-8">https://doi.org/10.1007/978-3-030-63287-8</a></li>
<li>Oded Goldreich. <i>On Post-Modern Cryptography.</i> Cryptology ePrint Archive, Report 2006/461. 2006. url: <a href="https://eprint.iacr.org/2006/461">https://eprint.iacr.org/2006/461</a></li>
<li>Phillip Rogaway. <i>Practice-Oriented Provable Security and the Social Construction of Cryptography.</i> In: IEEE Secur. Priv. 14.6 (2016), pp. 10–17. doi: 10.1109/MSP.2016.122. url: <a href="https://doi.org/10.1109/MSP.2016.122">https://doi.org/10.1109/MSP.2016.122</a></li>
</ul>

<p>
<b>Dramatis Personae</b>
</p>

<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/Phillip_Rogaway">Phil Rogaway</a></li>
<li><a href="https://en.wikipedia.org/wiki/Mihir_Bellare">Mihir Bellare</a></li>
<li><a href="http://www.arno-mittelbach.de/">Arno Mittelbach</a></li>
<li><a href="https://www.cryptoplexity.informatik.tu-darmstadt.de/cryptoplexity/team_cryptoplexity/marc_fischlin_cryptoplexity/index.en.jsp">Marc Fischlin</a></li>
<li><a href="https://en.wikipedia.org/wiki/Oded_Goldreich">Oded Goldreich</a></li>
</ul>
</div>
</div>

<div id="outline-container-org273817f" class="outline-2">
<h2 id="org273817f">The Fujisaki-Okamoto Transform</h2>
<div class="outline-text-2" id="text-org273817f">
<p>
We will discuss the Fujisaki-Okamoto (FO) Transform for converting CPA secure schemes into CCA secure schemes in the random oracle model … using one weird trick, adversaries hate it.
</p>

<p>
<a href="./7CCSMATC/lecture-fo.pdf">slides</a>
</p>

<p>
<b>Preparatory Reading</b>
</p>

<ul class="org-ul">
<li>Alexander W. Dent. <i>A Designer’s Guide to KEMs.</i> In: 9th IMA International Conference on Cryptography and Coding. Ed. by Kenneth G. Paterson. Vol. 2898. LNCS. Springer, Berlin, Heidelberg, Dec. 2003, pp. 133–151. doi: 10.1007/978-3-540-40974-8_12</li>
</ul>

<p>
<b>Dramatis Personae</b>
</p>

<ul class="org-ul">
<li><a href="https://www.jaist.ac.jp/~fujisaki/index-e.html">Eiichiro Fujisaki</a></li>
<li><a href="https://www.rd.ntt/e/organization/researcher/fellow/f_001.html">Tatsuaki Okamoto</a></li>
<li><a href="http://cogentcryptography.com/">Alexander W. Dent</a></li>
</ul>
</div>
</div>

<div id="outline-container-org4b5b6e6" class="outline-2">
<h2 id="org4b5b6e6">Hash-and-Sign Signatures</h2>
<div class="outline-text-2" id="text-org4b5b6e6">
<p>
We discuss the hash-and-sign signature paradigm, proven secure in the random oracle model. We also discuss the GPV signature scheme paradigm, of which Falcon (soon to be a NIST standard for post-quantum signatures) is an example.
</p>

<p>
<a href="./7CCSMATC/lecture-gpv-signatures.pdf">slides</a>
</p>

<p>
<b>Preparatory Reading</b>
</p>

<ul class="org-ul">
<li>Craig Gentry, Chris Peikert, and Vinod Vaikuntanathan. <i>Trapdoors for hard lattices and new cryptographic constructions</i>. In: 40th ACM STOC. ed. by Richard E. Ladner and Cynthia Dwork. ACM Press, May 2008, pp.197–206. doi: 10.1145/1374376.1374407</li>
</ul>

<p>
<b>Dramatis Personae</b>
</p>

<ul class="org-ul">
<li><a href="https://homepages.cwi.nl/~ducas/">Léo Ducas</a></li>
<li><a href="https://en.wikipedia.org/wiki/Craig_Gentry">Craig Gentry</a></li>
<li><a href="https://web.eecs.umich.edu/~cpeikert/">Chris Peikert</a></li>
<li><a href="https://en.wikipedia.org/wiki/Vinod_Vaikuntanathan">Vinod Vaikuntanathan</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5d5dd70" class="outline-2">
<h2 id="org5d5dd70">Rewinding</h2>
<div class="outline-text-2" id="text-org5d5dd70">
<p>
We discuss "rewinding" as a cryptographic proof technique, typically in the random oracle model (ROM). We can make an adversary reveal its secrets by making it solving a task more than once.
</p>

<p>
<a href="./7CCSMATC/lecture-rewinding.pdf">slides</a>
</p>

<p>
<b>Preparatory Reading</b>
</p>

<ul class="org-ul">
<li>Arno Mittelbach and Marc Fischlin. Chapter 10: Random Oracle Schemes in Practice. In: The Theory of Hash Functions and Random Oracles - An Approach to Modern Cryptography. Information Security and Cryptography. Springer, 2021. isbn: 978-3-030-63286-1. doi: 10.1007/978-3-030-63287-8. url: <a href="https://doi.org/10.1007/978-3-030-63287-8">https://doi.org/10.1007/978-3-030-63287-8</a></li>
<li>Ivan Damgård. <i>On Σ-protocols</i>. In: Lecture Notes, University of Aarhus, Department for Computer Science 84 (2002). <a href="https://www.cs.au.dk/~ivan/Sigma.pdf">https://www.cs.au.dk/~ivan/Sigma.pdf</a></li>
</ul>

<p>
<b>Dramatis Personae</b>
</p>

<ul class="org-ul">
<li><a href="http://www.arno-mittelbach.de/">Arno Mittelbach</a></li>
<li><a href="https://www.cryptoplexity.informatik.tu-darmstadt.de/cryptoplexity/team_cryptoplexity/marc_fischlin_cryptoplexity/index.en.jsp">Marc Fischlin</a></li>
<li><a href="https://en.wikipedia.org/wiki/Claus_P._Schnorr">Claus-Peter Schnorr</a></li>
<li><a href="https://en.wikipedia.org/wiki/Ivan_Damg%C3%A5rd">Ivan Damgård</a></li>
<li><a href="https://en.wikipedia.org/wiki/Amos_Fiat">Amos Fiat</a></li>
<li><a href="https://en.wikipedia.org/wiki/Adi_Shamir">Adi Shamir</a></li>
<li><a href="https://crypto.stanford.edu/~eujin/">Eu-Jin Goh</a></li>
<li><a href="https://ics.uci.edu/people/stanislaw-jarecki/">Stanislaw Jarecki</a></li>
<li><a href="https://en.wikipedia.org/wiki/Jonathan_Katz">Jonathan Katz</a></li>
<li><a href="https://dblp.uni-trier.de/pid/w/NanWang.html">Nan Wang</a></li>
</ul>
</div>
</div>
