7CCSMATC.org
** Limits of Proofs (SSH Attack)

We discuss an attack on SSH which had been previously proven secure. The attack was possible because the model was not correct. In response a new model was proposed and then SSH was broken again, because that model still was not correct.

[[https://malb.github.io/7CCSMATC/lecture-ssh-attack.pdf][slides]]

*Preparatory Reading*

- Martin R. Albrecht, Kenneth G. Paterson, and Gaven J. Watson. /Plaintext Recovery Attacks against SSH./ In: 2009 IEEE Symposium on Security and Privacy. IEEE Computer Society Press, May 2009, pp. 16–26. doi: 10.1109/SP.2009.5

*Dramatis Personae*

- [[https://en.wikipedia.org/wiki/Kenny_Paterson][Kenneth G. Paterson]]
- [[https://ieeexplore.ieee.org/author/37088183260][Gaven J. Watson]]

** Limits of Proofs (Heartbleed Vulnerability)

TLS implements a "ping" command. A bug in its implementation allowed to extract secret keys. How can we hope to secure the Internet if we cannot get ping right? 

[[https://malb.github.io/7CCSMATC/lecture-heartbleed.pdf][slides]]

** Limits of Proofs (S2N Attack)

We discuss the "Lucky-13" attack which broke TLS implementations. The attack is "outside the model" of cryptographic proofs because it is a “side-channel attack”.

[[https://malb.github.io/7CCSMATC/lecture-s2n.pdf][slides]]

*Preparatory Reading*

- Nadhem J. AlFardan and Kenneth G. Paterson. /Lucky Thirteen: Breaking the TLS and DTLS Record Protocols./ In: 2013 IEEE Symposium on Security and Privacy. IEEE Computer Society Press, May 2013, pp. 526–540. doi: 10.1109/SP.2013.42

*Dramatis Personae*

- [[https://dblp.org/pid/82/9056.html][Nadhem J. AlFardan]]
- [[https://en.wikipedia.org/wiki/Kenny_Paterson][Kenneth G. Paterson]]

** Limits of Proofs (Societal Foundations)

We discuss that proofs of cryptographic security guarantees only hold under specific societal conditions.

[[https://malb.github.io/7CCSMATC/lecture-societal-foundations.pdf][slides]]

*Preparatory Reading*

- Whitfield Diffie and Martin E. Hellman. /New Directions in Cryptography./ In: IEEE Transactions on Information Theory 22.6 (1976), pp. 644–654. doi: 10.1109/TIT.1976.1055638

*Dramatis Personae*

- [[https://en.wikipedia.org/wiki/Randall_Munroe][Randall Munroe]]
- [[https://en.wikipedia.org/wiki/Whitfield_Diffie][Whit Diffie]]
- [[https://en.wikipedia.org/wiki/Martin_Hellman][Martin Hellman]]
- [[https://en.wikipedia.org/wiki/Mireille_Hildebrandt][Mireille Hildebrandt]]
- [[https://en.wikipedia.org/wiki/Max_Weber][Max Weber]]
- [[https://www.brunel.ac.uk/people/mark-neocleous][Mark Neocleous]]
- [[https://en.wikipedia.org/wiki/Thomas_Hobbes][Thomas Hobbes]]
- [[https://en.wikipedia.org/wiki/John_Locke][John Locke]]
- [[https://en.wikipedia.org/wiki/Adam_Smith][Adam Smith]]
- [[https://en.wikipedia.org/wiki/William_Blackstone][William Blackstone]]
- [[https://en.wikipedia.org/wiki/Thomas_Paine][Thomas Paine]]  
- [[https://en.wikipedia.org/wiki/Ron_Rivest][Ron Rivest]]
- [[https://en.wikipedia.org/wiki/Adi_Shamir][Adi Shamir]]
- [[https://en.wikipedia.org/wiki/Leonard_Adleman][Leonard Adleman]]          

*Content Warning*

We talk about the regulation of online speech in this lecture which means we will mention child sexual exploitation and abuse (CSEA).

** Limits of Proofs (Social Foundations)

We discuss that cryptography is also a social science, done poorly.

[[https://malb.github.io/7CCSMATC/lecture-social-foundations.pdf][slides]]

*Preparatory Reading*

- Jean-François Blanchette. /Burdens of Proof: Cryptographic Culture and Evidence Law in the Age of Electronic Documents/. MIT Press, 2012, Chapter 4: The Equivalent of a Written Signature

*Dramatis Personae*

- [[https://pages.gseis.ucla.edu/faculty/blanchette/][Jean-François Blanchette]]
- [[https://en.wikipedia.org/wiki/Oded_Goldreich][Oded Goldreich]]
- [[https://www.jorgeblascoalis.com/][Jorge Blasco]]
- [[https://rikkebjerg.gitlab.io/me/][Rikke Bjerg Jensen]]
- [[https://lenka.sh/][Lenka Mareková]]
- [[https://cis.cnrs.fr/en/ksenia_ermoshina/][Ksenia Ermoshina]]
- [[https://www.ibiblio.org/hhalpin/][Harry Halpin]]
- [[https://cis.cnrs.fr/francesca-musiani/][Francesca Musiani]]


#+include: footer.org

# Local Variables:
# eval: (add-hook 'after-save-hook (lambda () (when (eq major-mode 'org-mode) (org-html-export-to-html))) nil t)
# End:
