7CCSMATC.html

<div id="outline-container-org31d5f90" class="outline-2">
<h2 id="org31d5f90">Limits of Proofs (SSH Attack)</h2>
<div class="outline-text-2" id="text-org31d5f90">
<p>
We discuss an attack on SSH which had been previously proven secure. The attack was possible because the model was not correct. In response a new model was proposed and then SSH was broken again, because that model still was not correct.
</p>

<p>
<a href="./7CCSMATC/lecture-ssh-attack.pdf">slides</a>
</p>

<p>
<b>Preparatory Reading</b>
</p>

<ul class="org-ul">
<li>Martin R. Albrecht, Kenneth G. Paterson, and Gaven J. Watson. <i>Plaintext Recovery Attacks against SSH.</i> In: 2009 IEEE Symposium on Security and Privacy. IEEE Computer Society Press, May 2009, pp. 16–26. doi: 10.1109/SP.2009.5</li>
</ul>

<p>
<b>Dramatis Personae</b>
</p>

<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/Kenny_Paterson">Kenneth G. Paterson</a></li>
<li><a href="https://ieeexplore.ieee.org/author/37088183260">Gaven J. Watson</a></li>
</ul>
</div>
</div>

<div id="outline-container-org811cba1" class="outline-2">
<h2 id="org811cba1">Limits of Proofs (Heartbleed)</h2>
<div class="outline-text-2" id="text-org811cba1">
<p>
TLS implements a "ping" command. A bug in its implementation allowed to extract secret keys. How can we hope to secure the Internet if we cannot get ping right? 
</p>

<p>
<a href="./7CCSMATC/lecture-heartbleed.pdf">slides</a>
</p>
</div>
</div>

<div id="outline-container-org0f16859" class="outline-2">
<h2 id="org0f16859">Limits of Proofs (S2N)</h2>
<div class="outline-text-2" id="text-org0f16859">
<p>
We discuss the "Lucky-13" attack which broke TLS implementations. The attack is "outside the model" of cryptographic proofs because it is a “side-channel attack”.
</p>

<p>
<a href="./7CCSMATC/lecture-s2n.pdf">slides</a>
</p>

<p>
<b>Preparatory Reading</b>
</p>

<ul class="org-ul">
<li>Nadhem J. AlFardan and Kenneth G. Paterson. <i>Lucky Thirteen: Breaking the TLS and DTLS Record Protocols.</i> In: 2013 IEEE Symposium on Security and Privacy. IEEE Computer Society Press, May 2013, pp. 526–540. doi: 10.1109/SP.2013.42</li>
</ul>

<p>
<b>Dramatis Personae</b>
</p>

<ul class="org-ul">
<li><a href="https://dblp.org/pid/82/9056.html">Nadhem J. AlFardan</a></li>
<li><a href="https://en.wikipedia.org/wiki/Kenny_Paterson">Kenneth G. Paterson</a></li>
</ul>
</div>
</div>

<div id="outline-container-org7a57c24" class="outline-2">
<h2 id="org7a57c24">Limits of Proofs (Societal Foundations)</h2>
<div class="outline-text-2" id="text-org7a57c24">
<p>
We discuss that proofs of cryptographic security guarantees only hold under specific societal conditions.
</p>

<p>
<a href="./7CCSMATC/lecture-societal-foundations.pdf">slides</a>
</p>

<p>
<b>Preparatory Reading</b>
</p>

<ul class="org-ul">
<li>Whitfield Diffie and Martin E. Hellman. <i>New Directions in Cryptography.</i> In: IEEE Transactions on Information Theory 22.6 (1976), pp. 644–654. doi: 10.1109/TIT.1976.1055638</li>
</ul>

<p>
<b>Dramatis Personae</b>
</p>

<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/Whitfield_Diffie">Whit Diffie</a></li>
<li><a href="https://en.wikipedia.org/wiki/Martin_Hellman">Martin Hellman</a></li>
<li><a href="https://en.wikipedia.org/wiki/Mireille_Hildebrandt">Mireille Hildebrandt</a></li>
<li><a href="https://en.wikipedia.org/wiki/Max_Weber">Max Weber</a></li>
<li><a href="https://www.brunel.ac.uk/people/mark-neocleous">Mark Neocleous</a></li>
<li><a href="https://en.wikipedia.org/wiki/Thomas_Hobbes">Thomas Hobbes</a></li>
<li><a href="https://en.wikipedia.org/wiki/John_Locke">John Locke</a></li>
<li><a href="https://en.wikipedia.org/wiki/Adam_Smith">Adam Smith</a></li>
<li><a href="https://en.wikipedia.org/wiki/William_Blackstone">William Blackstone</a></li>
<li><a href="https://en.wikipedia.org/wiki/Thomas_Paine">Thomas Paine</a></li>
<li><a href="https://en.wikipedia.org/wiki/Ron_Rivest">Ron Rivest</a></li>
<li><a href="https://en.wikipedia.org/wiki/Adi_Shamir">Adi Shamir</a></li>
<li><a href="https://en.wikipedia.org/wiki/Leonard_Adleman">Leonard Adleman</a></li>
</ul>

<p>
<b>Content Warning</b>
</p>

<p>
We talk about the regulation of online speech in this lecture which means we will mention child sexual exploitation and abuse (CSEA).
</p>
</div>
</div>

<div id="outline-container-org3109886" class="outline-2">
<h2 id="org3109886">Limits of Proofs (Social Foundations)</h2>
<div class="outline-text-2" id="text-org3109886">
<p>
We discuss that cryptography is also a social science, done poorly.
</p>

<p>
<a href="./7CCSMATC/lecture-social-foundations.pdf">slides</a>
</p>

<p>
<b>Preparatory Reading</b>
</p>

<ul class="org-ul">
<li>Jean-François Blanchette. <i>Burdens of Proof: Cryptographic Culture and Evidence Law in the Age of Electronic Documents</i>. MIT Press, 2012, Chapter 4: The Equivalent of a Written Signature</li>
</ul>

<p>
<b>Dramatis Personae</b>
</p>

<ul class="org-ul">
<li><a href="https://pages.gseis.ucla.edu/faculty/blanchette/">Jean-François Blanchette</a></li>
<li><a href="https://en.wikipedia.org/wiki/Oded_Goldreich">Oded Goldreich</a></li>
<li><a href="https://www.jorgeblascoalis.com/">Jorge Blasco</a></li>
<li><a href="https://rikkebjerg.gitlab.io/me/">Rikke Bjerg Jensen</a></li>
<li><a href="https://lenka.sh/">Lenka Mareková</a></li>
<li><a href="https://cis.cnrs.fr/en/ksenia_ermoshina/">Ksenia Ermoshina</a></li>
<li><a href="https://www.ibiblio.org/hhalpin/">Harry Halpin</a></li>
<li><a href="https://cis.cnrs.fr/francesca-musiani/">Francesca Musiani</a></li>
</ul>


<div class="HTML" id="org528639c">
<p>

</p>

</div>
</div>
</div>
</div>
</body>
</html>
